bids/load-test.yml
config:
  plugins:
    json-include: {}
  target: "https://api.pikapool.cool/"
  phases:
    - duration: 5
      arrivalRate: 5
      name: Warm up
    - duration: 6000
      arrivalRate: 5
      rampTo: 500
      name: Ramp up load
    - duration: 600
      arrivalRate: 500
      name: Sustained load

scenarios:
  - flow:
      - put:
          url: "/v0/bids"
          json: "!include(example-bid-payload.json)"